bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA128A.xml
            <module name="BOOT_LOAD">
                <instance name="BOOT_LOAD" caption="Bootloader">
                    <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data" caption="Bootloader"/>
                </instance>
            </module>
            <module name="JTAG">
                <instance name="JTAG" caption="JTAG Interface">
                    <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data" caption="JTAG Interface"/>
                    <signals>
                        <signal group="TCK" function="default" pad="PF4"/>
                        <signal group="TMS" function="default" pad="PF5"/>
                        <signal group="TDI" function="default" pad="PF7"/>
                        <signal group="TDO" function="default" pad="PF6"/>
                    </signals>
                </instance>
            </module>
            <module name="MISC">
                <instance name="MISC" caption="Other Registers">
                    <register-group name="MISC" name-in-module="MISC" offset="0x00" address-space="data" caption="Other Registers"/>
                    <signals>
                        <signal group="PDI" function="default" pad="PE0"/>
                        <signal group="PDO" function="default" pad="PE1"/>
                        <signal group="OC3C" function="default" pad="PE5"/>
                        <signal group="TOSC" index="2" function="default" pad="PG3"/>
                        <signal group="TOSC" index="1" function="default" pad="PG4"/>
                        <signal group="WR" function="default" pad="PG0"/>
                        <signal group="RD" function="default" pad="PG1"/>
                        <signal group="A" index="8" function="default" pad="PC0"/>
                        <signal group="A" index="9" function="default" pad="PC1"/>
                        <signal group="A" index="10" function="default" pad="PC2"/>
                        <signal group="A" index="11" function="default" pad="PC3"/>
                        <signal group="A" index="12" function="default" pad="PC4"/>
                        <signal group="A" index="13" function="default" pad="PC5"/>
                        <signal group="A" index="14" function="default" pad="PC6"/>
                        <signal group="A" index="15" function="default" pad="PC7"/>
                        <signal group="ALE" function="default" pad="PG2"/>
                        <signal group="AD" index="7" function="default" pad="PA7"/>
                        <signal group="AD" index="6" function="default" pad="PA6"/>
                        <signal group="AD" index="5" function="default" pad="PA5"/>
                        <signal group="AD" index="4" function="default" pad="PA4"/>
                        <signal group="AD" index="3" function="default" pad="PA3"/>
                        <signal group="AD" index="2" function="default" pad="PA2"/>
                        <signal group="AD" index="1" function="default" pad="PA1"/>
                        <signal group="AD" index="0" function="default" pad="PA0"/>
                    </signals>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
                    <signals>
                        <signal group="INT" index="0" function="default" pad="PD0"/>
                        <signal group="INT" index="1" function="default" pad="PD1"/>
                        <signal group="INT" index="2" function="default" pad="PD2"/>
                        <signal group="INT" index="3" function="default" pad="PD3"/>
                        <signal group="INT" index="4" function="default" pad="PE4"/>
                        <signal group="INT" index="5" function="default" pad="PE5"/>
                        <signal group="INT" index="6" function="default" pad="PE6"/>
                        <signal group="INT" index="7" function="default" pad="PE7"/>
                    </signals>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM" caption="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
                </instance>
            </module>
            <module name="PORT">
                <instance name="PORTA" caption="I/O Port">
                    <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PA0" index="0"/>
                        <signal group="P" function="default" pad="PA1" index="1"/>
                        <signal group="P" function="default" pad="PA2" index="2"/>
                        <signal group="P" function="default" pad="PA3" index="3"/>
                        <signal group="P" function="default" pad="PA4" index="4"/>
                        <signal group="P" function="default" pad="PA5" index="5"/>
                        <signal group="P" function="default" pad="PA6" index="6"/>
                        <signal group="P" function="default" pad="PA7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PB0" index="0"/>
                        <signal group="P" function="default" pad="PB1" index="1"/>
                        <signal group="P" function="default" pad="PB2" index="2"/>
                        <signal group="P" function="default" pad="PB3" index="3"/>
                        <signal group="P" function="default" pad="PB4" index="4"/>
                        <signal group="P" function="default" pad="PB5" index="5"/>
                        <signal group="P" function="default" pad="PB6" index="6"/>
                        <signal group="P" function="default" pad="PB7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTC" caption="I/O Port">
                    <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PC0" index="0"/>
                        <signal group="P" function="default" pad="PC1" index="1"/>
                        <signal group="P" function="default" pad="PC2" index="2"/>
                        <signal group="P" function="default" pad="PC3" index="3"/>
                        <signal group="P" function="default" pad="PC4" index="4"/>
                        <signal group="P" function="default" pad="PC5" index="5"/>
                        <signal group="P" function="default" pad="PC6" index="6"/>
                        <signal group="P" function="default" pad="PC7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTD" caption="I/O Port">
                    <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PD0" index="0"/>
                        <signal group="P" function="default" pad="PD1" index="1"/>
                        <signal group="P" function="default" pad="PD2" index="2"/>
                        <signal group="P" function="default" pad="PD3" index="3"/>
                        <signal group="P" function="default" pad="PD4" index="4"/>
                        <signal group="P" function="default" pad="PD5" index="5"/>
                        <signal group="P" function="default" pad="PD6" index="6"/>
                        <signal group="P" function="default" pad="PD7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTE" caption="I/O Port">
                    <register-group name="PORTE" name-in-module="PORTE" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PE0" index="0"/>
                        <signal group="P" function="default" pad="PE1" index="1"/>
                        <signal group="P" function="default" pad="PE2" index="2"/>
                        <signal group="P" function="default" pad="PE3" index="3"/>
                        <signal group="P" function="default" pad="PE4" index="4"/>
                        <signal group="P" function="default" pad="PE5" index="5"/>
                        <signal group="P" function="default" pad="PE6" index="6"/>
                        <signal group="P" function="default" pad="PE7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTF" caption="I/O Port">
                    <register-group name="PORTF" name-in-module="PORTF" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PF0" index="0"/>
                        <signal group="P" function="default" pad="PF1" index="1"/>
                        <signal group="P" function="default" pad="PF2" index="2"/>
                        <signal group="P" function="default" pad="PF3" index="3"/>
                        <signal group="P" function="default" pad="PF4" index="4"/>
                        <signal group="P" function="default" pad="PF5" index="5"/>
                        <signal group="P" function="default" pad="PF6" index="6"/>
                        <signal group="P" function="default" pad="PF7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTG" caption="I/O Port">
                    <register-group name="PORTG" name-in-module="PORTG" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PG0" index="0"/>
                        <signal group="P" function="default" pad="PG1" index="1"/>
                        <signal group="P" function="default" pad="PG2" index="2"/>
                        <signal group="P" function="default" pad="PG3" index="3"/>
                        <signal group="P" function="default" pad="PG4" index="4"/>
                    </signals>
                </instance>
            </module>
