bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA128A.xml
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="External SRAM Enable" mask="0x80" name="SRE"/>
                    <bitfield caption="External SRAM Wait State Select" mask="0x40" name="SRW10"/>
                    <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
                    <bitfield caption="Sleep Mode Select" mask="0x18" name="SM"/>
                    <bitfield caption="Sleep Mode Select" mask="0x04" name="SM2" values="CPU_SLEEP_MODE_2BITS1"/>
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                    <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
                </register>
                <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="External Memory Control Register A" name="XMCRA" offset="0x6D" size="1">
                    <bitfield caption="Wait state page limit" mask="0x70" name="SRL" values="CPU_SECTOR_LIMITS"/>
                    <bitfield caption="Wait state select bit lower page" mask="0x0C" name="SRW0" values="CPU_WAIT_STATES"/>
                    <bitfield caption="Wait state select bit upper page" mask="0x02" name="SRW11"/>
                </register>
                <register caption="External Memory Control Register B" name="XMCRB" offset="0x6C" size="1">
                    <bitfield caption="External Memory Bus Keeper Enable" mask="0x80" name="XMBK"/>
                    <bitfield caption="External Memory High Mask" mask="0x07" name="XMM"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x6F" size="1" mask="0xFF">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="XTAL Divide Control Register" name="XDIV" offset="0x5C" size="1" mask="0xFF"/>
                <register caption="RAM Page Z Select Register" name="RAMPZ" offset="0x5B" size="1">
                    <bitfield caption="RAM Page Z Select Register Bit 0" mask="0x01" name="RAMPZ0"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_SECTOR_LIMITS">
                <value caption="LS = N/A, US = 0x1100 - 0xFFFF" name="VAL_0x00" value="0x00"/>
                <value caption="LS = 0x1100 - 0x1FFF, US = 0x2000 - 0xFFFF" name="VAL_0x01" value="0x01"/>
                <value caption="LS = 0x1100 - 0x3FFF, US = 0x4000 - 0xFFFF" name="VAL_0x02" value="0x02"/>
                <value caption="LS = 0x1100 - 0x5FFF, US = 0x6000 - 0xFFFF" name="VAL_0x03" value="0x03"/>
                <value caption="LS = 0x1100 - 0x7FFF, US = 0x8000 - 0xFFFF" name="VAL_0x04" value="0x04"/>
                <value caption="LS = 0x1100 - 0x9FFF, US = 0xA000 - 0xFFFF" name="VAL_0x05" value="0x05"/>
                <value caption="LS = 0x1100 - 0xBFFF, US = 0xC000 - 0xFFFF" name="VAL_0x06" value="0x06"/>
                <value caption="LS = 0x1100 - 0xDFFF, US = 0xE000 - 0xFFFF" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="CPU_WAIT_STATES">
                <value caption="No wait-states" name="VAL_0x00" value="0x00"/>
                <value caption="Wait one cycle during read/write strobe" name="VAL_0x01" value="0x01"/>
                <value caption="Wait two cycles during read/write strobe" name="VAL_0x02" value="0x02"/>
                <value caption="Wait two cycles during read/write and wait one cycle before driving out new address" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="1.0 MHz " name="1_0_MHz_"/>
                <value value="0x01" caption="2.0 MHz " name="2_0_MHz_"/>
                <value value="0x02" caption="4.0 MHz " name="4_0_MHz_"/>
                <value value="0x03" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_2BITS1">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x02"/>
                <value caption="Power Down" name="PDOWN" value="0x04"/>
                <value caption="Power Save" name="PSAVE" value="0x06"/>
                <value caption="Standby" name="STDBY" value="0x05"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x68" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
