bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA128A.xml
                <register caption="Timer/Counter1 Output Compare Register Bytes" name="OCR1B" offset="0x48" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register Bytes" name="OCR1C" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Input Capture Register Bytes" name="ICR1" offset="0x46" size="2" mask="0xFFFF"/>
            </register-group>
            <register-group caption="Timer/Counter, 16-bit" name="TC3">
                <register caption="Extended Timer/Counter Interrupt Mask Register" name="ETIMSK" offset="0x7D" size="1">
                    <bitfield caption="Timer/Counter3 Input Capture Interrupt Enable" mask="0x20" name="TICIE3"/>
                    <bitfield caption="Timer/Counter3 Output CompareA Match Interrupt Enable" mask="0x10" name="OCIE3A"/>
                    <bitfield caption="Timer/Counter3 Output CompareB Match Interrupt Enable" mask="0x08" name="OCIE3B"/>
                    <bitfield caption="Timer/Counter3 Overflow Interrupt Enable" mask="0x04" name="TOIE3"/>
                    <bitfield caption="Timer/Counter3, Output Compare Match Interrupt Enable" mask="0x02" name="OCIE3C"/>
                </register>
                <register caption="Extended Timer/Counter Interrupt Flag register" name="ETIFR" offset="0x7C" size="1" ocd-rw="R">
                    <bitfield caption="Input Capture Flag 3" mask="0x20" name="ICF3"/>
                    <bitfield caption="Output Compare Flag 3A" mask="0x10" name="OCF3A"/>
                    <bitfield caption="Output Compare Flag 3B" mask="0x08" name="OCF3B"/>
                    <bitfield caption="Timer/Counter3 Overflow Flag" mask="0x04" name="TOV3"/>
                    <bitfield caption="Timer/Counter3 Output Compare C Match Flag" mask="0x02" name="OCF3C"/>
                </register>
                <register caption="Special Function IO Register" name="SFIOR" offset="0x40" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset, T/C3, T/C2, T/C1" mask="0x01" name="PSR321"/>
                </register>
                <register caption="Timer/Counter3 Control Register A" name="TCCR3A" offset="0x8B" size="1">
                    <bitfield caption="Compare Output Mode 3A, bits" mask="0xC0" name="COM3A"/>
                    <bitfield caption="Compare Output Mode 3B, bits" mask="0x30" name="COM3B"/>
                    <bitfield caption="Compare Output Mode 3C, bits" mask="0x0C" name="COM3C"/>
                    <bitfield caption="Waveform Generation Mode Bits" mask="0x03" name="WGM3"/>
                </register>
                <register caption="Timer/Counter3 Control Register B" name="TCCR3B" offset="0x8A" size="1">
                    <bitfield caption="Input Capture 3  Noise Canceler" mask="0x80" name="ICNC3"/>
                    <bitfield caption="Input Capture 3 Edge Select" mask="0x40" name="ICES3"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM3" lsb="2"/>
                    <bitfield caption="Clock Select3 bits" mask="0x07" name="CS3" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter3 Control Register C" name="TCCR3C" offset="0x8C" size="1">
                    <bitfield caption="Force Output Compare for channel A" mask="0x80" name="FOC3A"/>
                    <bitfield caption="Force Output Compare for channel B" mask="0x40" name="FOC3B"/>
                    <bitfield caption="Force Output Compare for channel C" mask="0x20" name="FOC3C"/>
                </register>
                <register caption="Timer/Counter3 Bytes" name="TCNT3" offset="0x88" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register A Bytes" name="OCR3A" offset="0x86" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register B Bytes" name="OCR3B" offset="0x84" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output compare Register C Bytes" name="OCR3C" offset="0x82" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Input Capture Register Bytes" name="ICR3" offset="0x80" size="2" mask="0xFFFF"/>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC2">
                <register caption="Timer/Counter Control Register" name="TCCR2" offset="0x45" size="1">
                    <bitfield caption="Force Output Compare" mask="0x80" name="FOC2"/>
                    <bitfield caption="Wafeform Generation Mode" mask="0x40" name="WGM20" values="WAVEFORM_GEN_MODE"/>
                    <bitfield caption="Compare Match Output Mode" mask="0x30" name="COM2"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM21"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS2" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter Register" name="TCNT2" offset="0x44" size="1" mask="0xFF"/>
                <register caption="Output Compare Register" name="OCR2" offset="0x43" size="1" mask="0xFF"/>
                <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x56" size="1" ocd-rw="R">
                    <bitfield caption="Output Compare Flag 2" mask="0x80" name="OCF2"/>
                    <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x40" name="TOV2"/>
                </register>
